"app.title" = "Informazioni di Sistema Mac";
"cpu.title" = "CPU";
"cpu.usage" = "Utilizzo: %.1f%%";
"cpu.cores" = "Utilizzo dei core";

"ram.title" = "Memoria";
"ram.usage" = "%.1f%% Usato";

"disk.title" = "Disco";
"disk.usage" = "%.1f%% Usato";

"network.title" = "Rete";

"info.title" = "Informazioni Generali";
"info.host" = "Nome del computer";
"info.model" = "Modello";
"info.os" = "Sistema operativo";
"info.processor" = "Processore";
"info.ramTotal" = "Memoria totale";
"info.diskTotal" = "Spazio totale";
"info.localIP" = "IP locale";
"info.publicIP" = "IP pubblico";
"info.temp" = "Stato della temperatura";

"button.settings" = "Impostazioni";
"button.quit" = "Esci dall'app";
"button.save" = "Salva modifiche";
"button.close" = "Chiudi";
"button.help" = "Guida utente";
"button.report" = "Crea rapporto";
"button.contact" = "Contattaci";
"button.showWindow" = "Modalità finestra";
"report.title" = "Rapporto di Sistema";
"report.subtitle" = "Riepilogo dei dettagli hardware e software";
"report.hardware" = "Specifiche Hardware";
"report.network" = "Informazioni di Rete";
"report.status" = "Stato Attuale";
"report.copy" = "Copia Rapporto";
"report.print" = "Stampa";
"report.date" = "Data del Rapporto";

"settings.title" = "Impostazioni";
"settings.general" = "Generale";
"settings.advanced" = "Avanzate";

"settings.view.title" = "Aspetto";
"settings.view.showWindow" = "Mostra come finestra";
"settings.view.showCores" = "Mostra utilizzo dei core";
"settings.view.showNetwork" = "Mostra scheda di rete";
"settings.view.showDisk" = "Mostra scheda disco";

"settings.monitor.title" = "Monitor di Sistema";
"settings.monitor.toggle" = "Arresta / Avvia monitoraggio";
"settings.monitor.energyMode" = "Modalità risparmio energetico";
"settings.monitor.refreshTime" = "Frequenza di aggiornamento: %.1f s";
"settings.monitor.reset" = "Ripristina cronologia CPU e Rete";

"settings.theme.title" = "Tema dell'aspetto";
"settings.theme.label" = "Tema";
"settings.theme.auto" = "Sistema";
"settings.theme.light" = "Chiaro";
"settings.theme.dark" = "Scuro";
"menu.startup.title" = "Avvio";
"menu.startup.enable" = "Avvia al login";
"menu.startup.disable" = "Disabilita avvio al login";

"temp.normal" = "Normale 🌡";
"temp.warm" = "Tiepido";
"temp.hot" = "Caldo 🔥";
"temp.critical" = "Critico 🚨";
"temp.unknown" = "Sconosciuto";
"ip.loading" = "Caricamento...";
"ip.notFound" = "Non trovato";
"unknown" = "Sconosciuto";

"settings.language.title" = "Lingua";
"settings.language.system" = "Predefinito di sistema";
"settings.language.restart" = "Riavvia l'app per rendere effettivi i cambiamenti di lingua.";

"help.title" = "Aiuto";
"help.subtitle" = "Sistem Bilgi – Funzionalità e guida all'uso";
"help.version" = "Sistem Bilgi – Versione 1.1  •  macOS 15+";
"help.developer" = "Sviluppatore: ModelPC";

"help.cpu.title" = "Utilizzo della CPU";
"help.cpu.desc" = "Mostra l'utilizzo del processore in tempo reale e la sua cronologia. Il grafico della CPU tiene traccia degli ultimi 30 rilevamenti. Diventa rosso sopra l'80% e lampeggia come avviso. Sui processori multi-core, abilita l'utilizzo per core in Impostazioni > Aspetto > 'Mostra utilizzo dei core'.";

"help.ram.title" = "Utilizzo della memoria (RAM)";
"help.ram.desc" = "La somma delle pagine attive, inattive e wired viene calcolata come memoria usata e visualizzata in percentuale. La barra di avanzamento blu mostra lo stato attuale.";

"help.disk.title" = "Utilizzo del disco";
"help.disk.desc" = "Mostra la capacità totale e lo spazio utilizzato del disco principale (/) come percentuale. È possibile nascondere la scheda Disco in Impostazioni > Aspetto > 'Mostra scheda disco'.";

"help.network.title" = "Utilizzo della rete";
"help.network.desc" = "Mostra la velocità totale di download + upload su tutte le interfacce di rete in KB/s. Il grafico visualizza gli ultimi 30 rilevamenti su una scala dinamica. Nascondilo in Impostazioni > Aspetto > 'Mostra scheda di rete'.";

"help.temp.title" = "Stato della temperatura";
"help.temp.desc" = "Il livello termico del sistema viene letto tramite l'API macOS ThermalState: Normale 🌡, Tiepido, Caldo 🔥 e Critico 🚨. I valori esatti della temperatura in gradi non sono messi a disposizione di terze parti da Apple.";

"help.settings.title" = "Impostazioni e Personalizzazione";
"help.settings.desc" = "Apri le impostazioni dall'icona della barra dei menu. Usa la scheda Aspetto per attivare/disattivare le schede. Scegli il tema Chiaro / Scuro / Auto nella scheda Avanzate. Regola la frequenza di aggiornamento tra 0,5 e 5 secondi. La modalità Risparmio energetico riduce la frequenza di aggiornamento quando l'app non è attiva.";

"help.menubar.title" = "Barra dei menu e Modalità finestra";
"help.menubar.desc" = "L'app viene eseguita nella barra dei menu per impostazione predefinita. Abilita la finestra stand-alone in Impostazioni > Aspetto > 'Mostra come finestra'. L'etichetta della barra dei menu mostra la percentuale della CPU in tempo reale e un mini grafico.";

"contact.title" = "Contatti";
"contact.subtitle" = "Contatta lo sviluppatore o seguilo sui social media";
"contact.email.title" = "Invia Email";
"contact.email.address" = "info@modelpc.com";
"contact.email.address2" = "Sviluppatore (modelpc91@gmail.com)";
"contact.social" = "Social Media";
"contact.social.youtube" = "YouTube";
"contact.social.github" = "GitHub";
"contact.social.x" = "X (Twitter)";
"contact.social.instagram" = "Instagram";
"contact.social.website" = "Sito Web";
